export type DoubleStandard = {
  queer: string;
  straight: string;
};

export const doubleStandards: DoubleStandard[] = [
  {
    queer: "«Γιατί χρειάζεται να το διαφημίζεις ότι είσαι gay;»",
    straight:
      "«Γιατί χρειάζεται να φοράς βέρα; Όλοι το ξέρουν ότι είσαι παντρεμένος.»",
  },
  {
    queer: "«Δεν έχω πρόβλημα με τους γκέι, έχω και φίλους γκέι.»",
    straight: "«Δεν έχω πρόβλημα με τους στρέιτ, έχω και φίλους στρέιτ.»",
  },
  {
    queer: "«Δεν έχω πρόβλημα με τις επιλογές σου, απλώς μην το συζητάμε.»",
    straight: "«Δεν έχω πρόβλημα με τον γάμο σου, απλώς μην το συζητάμε.»",
  },
  {
    queer: "«Γιατί όλα πλέον πρέπει να είναι τόσο πολιτικά;»",
    straight:
      "«Γιατί πρέπει συνέχεια να προβάλλεται η straight κουλτούρα παντού;»",
  },
];
